lycol_app_db/Lycol/LyCol_Backup_Complete_20250913_222751/app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `status` = 'ACTIVE'
AND `gender` = 'M'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `status` = 'ACTIVE'
AND `gender` = 'F'
SELECT `classes`.`name`, COUNT(*) as count
FROM `students`
JOIN `classes` ON `classes`.`id` = `students`.`current_class_id`
WHERE `students`.`status` = 'ACTIVE'
GROUP BY `classes`.`id`
---
    private function getStudentStats()
    {
        return [
            'total' => $this->studentModel->where('status', 'ACTIVE')->countAllResults(),
            'male' => $this->studentModel->where('status', 'ACTIVE')->where('gender', 'M')->countAllResults(),
            'female' => $this->studentModel->where('status', 'ACTIVE')->where('gender', 'F')->countAllResults(),
            'by_class' => $this->studentModel->select('classes.name, COUNT(*) as count')
                                           ->join('classes', 'classes.id = students.current_class_id')
                                           ->where('students.status', 'ACTIVE')
                                           ->groupBy('classes.id')
                                           ->find()

SELECT AVG(marks_obtained) as average, MIN(marks_obtained) as min, MAX(marks_obtained) as max, COUNT(*) as total
FROM `grades`
---
    private function getGradeStats()
    {
        $grades = $this->gradeModel->select('AVG(marks_obtained) as average, MIN(marks_obtained) as min, MAX(marks_obtained) as max, COUNT(*) as total')
                                  ->get()
                                  ->getRow();

SELECT SUM(amount_paid) as total, COUNT(*) as count
FROM `payments`
---
    private function getPaymentStats()
    {
        $payments = $this->paymentModel->select('SUM(amount_paid) as total, COUNT(*) as count')
                                     ->get()
                                     ->getRow();

SELECT COUNT(*) AS `numrows`
FROM `absences`
WHERE `justified` = 1
SELECT COUNT(*) AS `numrows`
FROM `absences`
WHERE `justified` = 0
---
    private function getAbsenceStats()
    {
        return [
            'total' => $this->absenceModel->countAllResults(),
            'justified' => $this->absenceModel->where('justified', 1)->countAllResults(),
            'unjustified' => $this->absenceModel->where('justified', 0)->countAllResults()