lycol_app_db/Lycol/LyCol_Backup_Complete_20250913_222751/app/Controllers/Configuration.php

SELECT *
FROM `licenses`
WHERE `status` = 'ACTIVE'
 LIMIT 1
---
    public function index()
    {
        try {
            // Récupérer les informations de licence
            $licenseModel = new \App\Models\LicenseModel();
            $license = $licenseModel->where('status', 'ACTIVE')->first();