lycol_app_db/Lycol/LyCol_Complete_Final_20250913_231500/app/Models/ClassModel.php

SELECT *
FROM `classes`
WHERE `is_active` = 1
ORDER BY `level` ASC, `name` ASC
---
    public function getActiveClasses()
    {
        return $this->where('is_active', 1)
                   ->orderBy('level', 'ASC')
                   ->orderBy('name', 'ASC')
                   ->findAll();