lycol_app_db/Lycol/LyCol_Complete_Final_20250913_231500/app/Models/TeacherAssignmentModel.php

    public function getRecentAssignments($limit = 5)
    {
        return $this->select('teacher_assignments.*, teachers.first_name, teachers.last_name, classes.name as class_name, subjects.name as subject_name')
                   ->join('teachers', 'teachers.id = teacher_assignments.teacher_id')
                   ->join('classes', 'classes.id = teacher_assignments.class_id')
                   ->join('subjects', 'subjects.id = teacher_assignments.subject_id')
                   ->where('teacher_assignments.is_active', 1)
                   ->orderBy('teacher_assignments.created_at', 'DESC')
                   ->limit($limit)
                   ->findAll();
---
SELECT `teacher_assignments`.*, `teachers`.`first_name`, `teachers`.`last_name`, `classes`.`name` as `class_name`, `subjects`.`name` as `subject_name`
FROM `teacher_assignments`
JOIN `teachers` ON `teachers`.`id` = `teacher_assignments`.`teacher_id`
JOIN `classes` ON `classes`.`id` = `teacher_assignments`.`class_id`
JOIN `subjects` ON `subjects`.`id` = `teacher_assignments`.`subject_id`
WHERE `teacher_assignments`.`is_active` = 1
ORDER BY `teacher_assignments`.`created_at` DESC
 LIMIT 5