lycol_app_db/Lycol/LyCol_Complete_Final_20250913_231500/app/Models/TeacherModel.php

SELECT `teachers`.*, `users`.`username`, `users`.`role_id`, `roles`.`name` as `role_name`
FROM `teachers`
LEFT JOIN `users` ON `users`.`id` = `teachers`.`user_id`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `teachers`.`is_active` = 1
---
    public function getActiveTeachers()
    {
        return $this->select('teachers.*, users.username, users.role_id, roles.name as role_name')
                    ->join('users', 'users.id = teachers.user_id', 'left')
                    ->join('roles', 'roles.id = users.role_id', 'left')
                    ->where('teachers.is_active', 1)
                    ->findAll();