lycol_app_db/Lycol/LyCol_Complete_Final_20250913_231500/app/Models/TimetableModel.php

    public function getActiveTimetables()
    {
        return $this->select('timetables.*, classes.name as class_name, subjects.name as subject_name,
                             CONCAT(teachers.first_name, " ", teachers.last_name) as teacher_name')
                   ->join('classes', 'classes.id = timetables.class_id')
                   ->join('subjects', 'subjects.id = timetables.subject_id')
                   ->join('teachers', 'teachers.id = timetables.teacher_id', 'left')
                   ->where('timetables.is_active', 1)
                   ->orderBy('timetables.day_of_week', 'ASC')
                   ->orderBy('timetables.start_time', 'ASC')
                   ->findAll();
---
SELECT `timetables`.*, `classes`.`name` as `class_name`, `subjects`.`name` as `subject_name`, CONCAT(teachers.first_name, " ", teachers.last_name) as teacher_name
FROM `timetables`
JOIN `classes` ON `classes`.`id` = `timetables`.`class_id`
JOIN `subjects` ON `subjects`.`id` = `timetables`.`subject_id`
LEFT JOIN `teachers` ON `teachers`.`id` = `timetables`.`teacher_id`
WHERE `timetables`.`is_active` = 1
ORDER BY `timetables`.`day_of_week` ASC, `timetables`.`start_time` ASC