lycol_app_db/Lycol/LyCol_Professional_Env_Final_20250913_231500/app/Controllers/Auth.php

    public function authenticate()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Validation des données
        $rules = [
            'username' => 'required|min_length[3]',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'Veuillez corriger les erreurs');
        }

        // Vérifier l'utilisateur
        $user = $this->userModel->where('username', $username)
                               ->where('is_active', 1)
                               ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `is_active` = 1
 LIMIT 1

        session()->set($sessionData);

        // Mettre à jour la dernière connexion
        $this->userModel->update($user['id'], ['last_login' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login` = '2025-09-13 22:03:54', `updated_at` = '2025-09-13 22:03:54'
WHERE `users`.`id` IN ('1')

    private function checkLicense()
    {
        // Récupérer la licence active
        $license = $this->licenseModel->where('status', 'ACTIVE')->first();
---
SELECT *
FROM `licenses`
WHERE `status` = 'ACTIVE'
 LIMIT 1

    private function getRoleName($roleId)
    {
        $roleModel = new \App\Models\RoleModel();
        $role = $roleModel->find($roleId);
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = '1'