{"translation-revision-date":"2024-07-30 00:31","generator":"WP-CLI\/2.10.0","source":"js\/editor.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"de_DE","plural-forms":"nplurals=2; plural=(n != 1);"},"Update":["Aktualisieren"],"Duplicate":["Duplizieren"],"Actions":["Aktionen"],"Advanced Settings":["Erweiterte Einstellungen"],"Limit":["Limit"],"Default":["Standard"],"Ascending":["Aufsteigend"],"Descending":["Absteigend"],"equals":["gleich"],"does not equal":["ist nicht gleich"],"is greater than":["ist größer als"],"is less than":["ist kleiner als"],"is greater than or equal to":["ist größer als oder gleich"],"is less than or equal to":["ist kleiner als oder gleich"],"contains":["enthält"],"does not contain":["enthält nicht"],"starts with":["beginnt mit"],"ends with":["endet mit"],"is unique (get oldest entries)":["ist einmalig (älteste Einträge abrufen)"],"is unique (get newest entries)":["ist einmalig (neueste Einträge abrufen)"],"Calendar":["Kalender"],"Grid":["Raster"],"Map":["Landkarte"],"Classic":["Klassisch"],"Entry creation date":["Eintrags-Erstellungsdatum"],"Event Date":["Anlassdatum"],"Entry update date":["Aktualisierungsdatum des Eintrags"],"End Date or Day Count":["Enddatum oder Zählung der Tage"],"Repeat":["Wiederholung"],"No repeating events":["Keine wiederholende Anlässe"],"End Repeat":["Ende Wiederholung"],"Never":["Niemals"],"If you don’t want all form entries displayed, you can insert the number limit here. Leave blank if you’d like all entries shown.":["Wenn du nicht möchtest, dass alle Formulareinträge angezeigt werden, kannst du hier die Anzahl der Einträge angeben. Lass das Feld leer, wenn du möchtest, dass alle Einträge angezeigt werden."],"Page Size":["Seitengröße"],"The number of entries to show per page. Leave blank to not use pagination.":["Die Anzahl der Einträge, die pro Seite gezeigt werden. Lassen Sie das Feld leer um keine Seitenzahlen zu verwenden."],"No Entries Message":["keine Einträge Nachricht"],"View Key":["Schlüssel anzeigen"],"Detail Page Slug":["URL-Bezeichner (slug) der Detail-Seite"],"Example: If parameter name is 'contact', the url would be like %1$s\/selected-page?contact=2. If this entry is linked to a post, the post permalink will be used instead.":["Beispiel: Wenn der Parameter Name 'kontakt' ist, wäre die URL z.B. %1$s\/selected-page?kontakt=2. Falls der Eintrag zu einem Beitrag verlinkt wird, wird der Beitrags- Permalink anstatt dessen verwendet."],"Detail Page":["Detail-Seite"],"Listing Page":["Listing-Seite"],"Use Entries from Form":["Benutzen der Einträge vom Formular"],"Random":["Zufällig"],"Date options: 'NOW' or a date in yyyy-mm-dd format.":["Datums- Optinen: 'HEUTE' oder ein Datum im JJJJ-MM-TT Format."],"The new %1$s is coming soon.":["Der neue %1$s kommt bald."],"Calendar Editor":["Kalender-Editor"],"COMING SOON":["DEMNÄCHST"],"to receive news about the latest updates.":["um über die neuesten Aktualisierungen informiert zu werden."],"Subscribe to Formidable Forms":["Abonniere Formidable Forms,"],"All content associated with this section will be deleted. Copy it and paste it into another section or it will be lost.":["Alle Inhalte, die mit diesem Abschnitt verbunden sind, werden gelöscht. Kopiere sie und füge sie in einen anderen Bereich ein, sonst gehen sie verloren."],"Cancel":["Abbrechen"],"Switch to Classic":["Zu Klassisch wechseln"],"Switch to Modern":[""],"Switch to Legacy":[""],"View Name":["Name der Ansicht"],"Detail Page Key":["Schlüssel der Detailseite"],"Reload full page":["Ganze Seite neu laden"],"AJAX pagination":["AJAX-Seitenzahlen"],"Load more entries":["Weitere Einträge laden"],"Infinite scroll":["Unendliches Scrollen"],"Pagination Type":["Art der Seitennummerierung"],"Calendar Settings":["Kalendereinstellungen"],"Event Time":[""],"Show Event Details Pop-up":[""],"When you hover over an event, a popup will appear with basic details about that event.":[""],"Pop-up Title":[""],"Pop-up Description":[""],"Pop-up Thumbnail":[""],"Select a form field that contains values like 1 week, 2 weeks, 1 year, etc. This will set the repeat period for each event.":["Wähle ein Formularfeld aus, das Werte wie 1 Woche, 2 Wochen, 1 Jahr, etc. enthält. Damit wird der Wiederholungszeitraum für jedes Ereignis festgelegt."],"Select":["Auswahlfeld"],"Grid Style Settings":["Einstellungen für Raster-Stile"],"Number of grid columns":["Anzahl der Rasterspalten"],"Row gap":["Zeilenabstand"],"Column gap":["Abstand zwischen den Spalten"],"Table Settings":["Tabelleneinstellungen"],"Row Style":["Zeilenstil"],"Match theme settings":["Theme-Einstellungen anpassen"],"Zebra stripes":["Zebrastreifen"],"Make table responsive":["Tabelle responsiv anlegen"],"If this is on, the each column will display as a full row when the browser window is smaller than 760px width.":["Wenn diese Option aktiviert ist, wird jede Spalte als ganze Zeile angezeigt, wenn das Browserfenster kleiner als 760px breit ist."],"Make grid responsive":["Raster responsiv anlegen"],"If this is on, the number of grid columns will go to one when the browser window is smaller than 750px width.":["Wenn diese Option aktiviert ist, wird die Anzahl der Rasterspalten auf eins reduziert, wenn das Browserfenster kleiner als 750px breit ist."],"Metaboxes":["Metaboxen"],"Cell Settings":["Zelleneinstellungen"],"Done":["Fertig"],"Switch to Classic View":["Zur klassischen Ansicht wechseln"],"Switch to Modern View":[""],"Switch to Legacy View":[""],"This is irreversible. You will not be able to change back to a %1$s after updating.":["Dies ist unumkehrbar. Du kannst nach der Aktualisierung nicht mehr zu %1$s zurückwechseln."],"Switching to classic gives you full control of the HTML, but it means that you will no longer have access to the layout builder or style editor tools.":["Wenn du auf klassisch umschaltest, hast du die volle Kontrolle über den HTML-Code, aber du hast keinen Zugriff mehr auf den Layout-Builder oder den Style-Editor."],"Are you sure you want to switch?":["Bist du sicher, dass du wechseln willst?"],"Switching to modern adds a pop up and uses new styling compared to legacy calendars.":[""],"Switching to legacy removes the pop up and uses styles from previous versions of Views.":[""],"Switch":["Wechseln"],"Small":["Klein"],"Regular":["Normal"],"Large":["Groß"],"Larger":["Größere"],"Custom":["Benutzerdefiniert"],"Typography":["Typografie"],"Background":["Hintergrund"],"Border":["Rahmen"],"Dotted":["Gepunktet"],"Dashed":["Gestrichelt"],"Solid":["Durchgehend"],"Double":["Doppelt"],"Groove":["Rillen"],"Ridge":["Ridge"],"Inset":["3D-Effekt (innen)"],"Outset":["Ausgangspunkt"],"None":["Keine"],"Hidden":["Verborgen"],"Toggle Border Radius Options":[""],"Border radius":["Eckenradius"],"Padding":["Innenabstand"],"Custom Classes":["Individuelle Klassen"],"Offset":["Versatz"],"Adjust the offset to start displaying results from a specific point in your data set. For example, with a 1 offset and a page size of 10, the query will start from the second record, displaying the next 10 results.":["Passe den Versatz an, damit die Ergebnisse ab einem bestimmten Punkt in deinem Datensatz angezeigt werden. Bei einem Versatz von 1 und einer Seitengröße von 10 beginnt die Abfrage z. B. beim zweiten Datensatz und zeigt die nächsten 10 Ergebnisse an."],"Copy this View to other sites when Formidable Forms is activated":["Kopiere diese Ansicht auf andere Websites, wenn Formidable Forms aktiviert ist"],"Refresh with AJAX when a form is submitted":[""],"Show code for this view":["Code für diese Ansicht anzeigen"],"When enabled, this feature triggers an AJAX refresh of the view upon submission of a Formidable form, seamlessly updating the content without requiring a page reload.":[""],"This box is forcibly checked if you include a <table> tag in the Before Content box. If you are editing a view and notice the visual tab is selected and the table HTML is missing, you can switch to the HTML tab, close the content pop up, and reopen it. As long as the settings have not been saved, the old HTML will be back to way it was before loading it in the visual tab. While this is checked, the preview will also display the HTML as code.":["Diese Checkbox wird zwingend aktiviert, wenn du ein <table> Tag in das Feld \"Vor dem Inhalt\" einfügst. Wenn du eine Ansicht bearbeitest und feststellst, dass die visuelle Registerkarte ausgewählt ist und der HTML-Code der Tabelle fehlt, kannst du zur HTML-Registerkarte wechseln, das Inhalts-Popup schließen und es erneut öffnen. Solange die Einstellungen nicht gespeichert wurden, ist der alte HTML-Code wieder so, wie er vor dem Laden in der visuellen Registerkarte war. Solange das Häkchen gesetzt ist, zeigt die Vorschau den HTML-Code auch als Code an."],"Filter Content":["Inhalt filtern"],"Run Formidable shortcodes only":["Nur Formidable Shortcodes ausführen"],"Add paragraphs and process shortcodes":["Absätze hinzufügen und Shortcodes verarbeiten"],"Run all content through WordPress (not recommended)":["Führe alle Inhalte über WordPress aus (nicht empfohlen)"],"Select datasource":["Datenquelle auswählen"],"Grid View":["Rasteransicht"],"Table View":["Tabellenansicht"],"Single entry":["Einzelner Eintrag"],"Insert view into application":["Ansicht in die Anwendung einfügen"],"Click this button to add view content":["Klicke auf diesen Button, um der Ansicht Inhalte hinzuzufügen"],"Add After Content":["Nach dem Inhalt hinzufügen"],"Add Before Content":["Vor dem Inhalt hinzufügen"],"Filter entries":["Einträge filtern"],"Sort entries":["Einträge sortieren"],"Manage columns":["Spalten verwalten"],"Layout builder":["Layout builder"],"Add new group":["Neue Gruppe hinzufügen"],"Enter value":["Wert eingeben"],"And":["Und"],"Or":["Oder"],"Select Field":["Feld auswählen"],"Add filter":["Filter hinzufügen"],"Add row":["Zeile hinzufügen"],"Manage table columns":["Tabellenspalten verwalten"],"Unselected fields":["Nicht ausgewählte Felder"],"Column Name":["Spaltenname"],"Add link to details page":["Link zur Detailseite hinzufügen"],"Delete":["Löschen"],"This form has no entries":["Dieses Formular hat keine Einträge"],"You can still add fields to this view. After receiving form submissions entries will be displayed here":["Du kannst immer noch Felder zu dieser Ansicht hinzufügen. Nach dem Empfang von Formular-Eingaben werden die Einträge hier angezeigt"],"Or select another form with entries in the Advanced Settings":["Oder wähle ein anderes Formular mit Einträgen in den erweiterten Einstellungen"],"Start adding content":["Mit dem Hinzufügen von Inhalten beginnen"],"This table has no columns set":["Diese Tabelle hat keine definierten Spalten"],"Click \"Manage columns\" to start adding columns.":["Klicke auf \"Spalten verwalten\", um mit dem Hinzufügen von Spalten zu beginnen."],"Build a repeatable layout":["Erstelle ein wiederholbares Layout"],"Create a layout to present form data by clicking or dragging the rows above":["Erstelle ein Layout, um Formulardaten darzustellen, indem du die Zeilen oben anklickst oder ziehst"],"start adding content":["mit dem Hinzufügen von Inhalten beginnen"],"into a single column view":["in einer Ansicht mit nur einer Spalte"],"Continue Anyway":["Auf jeden Fall fortfahren"],"Build a custom layout for the page":["Erstelle ein individuelles Layout für die Seite"],"Drag and drop rows into working area":["Zeilen in den Arbeitsbereich ziehen und ablegen"],"You can drop rows in a column and build complex layouts":["Du kannst Zeilen in einer Spalte ablegen und komplexe Layouts erstellen"],"The single entry detail view is not active":["Die Detailansicht des einzelnen Eintrags ist nicht aktiv"],"This content is used to show more information about a single entry.":["Dieser Inhalt wird verwendet, um mehr Informationen über einen einzelnen Eintrag anzuzeigen."],"To use this page, include the [detaillink] shortcode in the content for All Entries.":["Um diese Seite zu verwenden, füge den [detaillink] Shortcode in den Inhalt für \"Alle Einträge\" ein."],"Layout Builder":["Layout Builder"],"Add Detail Link":["Detail-Link hinzufügen"],"Build a layout":["Ein Layout erstellen"],"Build layout":["Layout erstellen"],"Drag and drop layout options to build a layout. You can also click an option to insert it.":["Ziehe die Layout-Optionen per Drag-and-drop, um ein Layout zu erstellen. Du kannst auch auf eine Option klicken, um sie einzufügen."],"Close":["Schließen"],"Are you ready to add data?":["Bist du bereit, Daten hinzuzufügen?"],"If you are happy with the layout, save it and start adding content to the view.":["Wenn du mit dem Layout zufrieden bist, speicherst du es und fügst der Ansicht Inhalte hinzu."],"Add content":["Inhalt hinzufügen"],"Add data from the form to separate layout cells.":["Füge Daten aus dem Formular in separate Layout-Zellen ein."],"You've reached the maximum level of nesting. Try to delete this box or use another one.":["Du hast die maximale Verschachtelungstiefe erreicht. Versuche, dieses Feld zu löschen oder ein anderes zu verwenden."],"Got it!":["Verstanden!"],"Click this button to add a row with one column":["Klicke auf diese Schaltfläche, um eine Zeile mit einer Spalte hinzuzufügen","Klicke auf diese Schaltfläche, um eine Zeile mit %1$d Spalten hinzuzufügen."],"and":["und"],"Click this button to add a row with %1$d columns, divided into %2$s":["Klicke auf diesen Button, um eine Zeile mit %1$d Spalten hinzuzufügen, die in %2$s unterteilt sind"],"Edit Before Content":["Vor dem Inhalt bearbeiten"],"Edit After Content":["Nach dem Inhalt bearbeiten"],"Edit Listing Page Content":["Inhalt der Listing-Seite bearbeiten"],"Edit Detail Page Content":["Inhalt der Detailseite bearbeiten"],"Navigate across the layout":["Navigiere durch das Layout"],"Start editing the content of multiple cells at once.":["Beginne mit der Bearbeitung des Inhalts mehrerer Zellen auf einmal."],"Additional view settings":["Zusätzliche Ansichtseinstellungen"],"Filter form entries, sort data, and toggle the layout builder at any time.":["Du kannst Formulareinträge filtern, Daten sortieren und den Layout-Builder jederzeit umschalten."],"Filter and sort form entries at any time.":["Du kannst die Formulareinträge jederzeit filtern und sortieren."],"Save Layout":["Layout speichern"],"View successfully saved!":["Ansicht erfolgreich gespeichert!"],"Search views":["Aufrufe anzeigen"]}}}