{"translation-revision-date":"2024-07-30 00:31","generator":"WP-CLI\/2.10.0","source":"js\/welcome.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"fr_FR","plural-forms":"nplurals=2; plural=(n > 1);"},"Welcome to Visual Views":["Bienvenue dans Visual Views"],"Use Views to build any custom web application you can imagine. It starts when users submit a form. The user-generated content can be used in job boards, staff directories, testimonials, recipes, and so much more.":["Utilisez les vues pour construire n’importe quelle application web personnalisée que vous pouvez imaginer. Tout commence lorsque les utilisateurs et utilisatrices soumettent un formulaire. Le contenu généré par l’utilisateur\/utilisatrice peut être utilisé dans les tableaux d’offres d’emploi, les annuaires du personnel, les témoignages, les recettes, et bien plus encore."],"Build a custom layout to display entries":["Construire une mise en page personnalisée pour afficher les entrées"],"Create a unique card layout to present form data. This card will repeat for each form entry.":["Créez une mise en page unique pour présenter les données du formulaire. Cette carte se répétera pour chaque entrée de formulaire."],"Add data to the View":["Ajouter des données à la vue"],"Click the plus icon then add or edit content in each box. The editor modal gives you access to the form data to insert.":["Cliquez sur l’icône plus, puis ajoutez ou modifiez le contenu dans chaque boîte. La modale de l’éditeur vous donne accès aux données du formulaire à insérer."],"Filter and sort form entries":["Filtrer et trier les entrées de formulaire"],"Add groups of conditions to get the exact entries you need.":["Ajoutez des groupes de conditions pour obtenir exactement les entrées dont vous avez besoin."],"Add content before the repeating sections":["Ajouter du contenu avant les sections répétitives"],"Add search boxes, table headers, and other content before the list of entries.":["Ajoutez des boîtes de recherche, des en-têtes de tableaux et d’autres contenus avant la liste des entrées."],"Continue":["continue"],"Skip":["Passer"]}}}