{"translation-revision-date":"2024-07-30 00:31","generator":"WP-CLI\/2.10.0","source":"js\/editor.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"it_IT","plural-forms":"nplurals=2; plural=(n != 1);"},"Update":["Aggiorna"],"Duplicate":["Duplica"],"Actions":["Azioni"],"Advanced Settings":["Impostazioni avanzate"],"Limit":["Limite"],"Default":["Predefinito"],"Ascending":["Ascendente"],"Descending":["Discendente"],"equals":["è uguale a"],"does not equal":["non è uguale a"],"is greater than":["è maggiore di"],"is less than":["è inferiore a"],"is greater than or equal to":["è maggiore o uguale a"],"is less than or equal to":["è inferiore o uguale a"],"contains":["contiene"],"does not contain":["non contiene"],"starts with":["inizia con"],"ends with":["finisce con"],"is unique (get oldest entries)":["è unico (ottieni le voci più vecchie)"],"is unique (get newest entries)":["è unico (ottieni le voci più recenti)"],"Calendar":["Calendario"],"Grid":["Griglia"],"Map":["Mappa"],"Classic":["Classico"],"Entry creation date":["Data di creazione Voci"],"Event Date":["Data Evento"],"Entry update date":["Data Aggiornamento"],"End Date or Day Count":["Data di fine o Conteggio Giorno"],"Repeat":["Ripeti"],"No repeating events":["Non ripetere evento"],"End Repeat":["Fine ripetizione"],"Never":["Mai"],"If you don’t want all form entries displayed, you can insert the number limit here. Leave blank if you’d like all entries shown.":["Se non vuoi che vengano visualizzate tutte le voci del modulo, puoi inserire qui il limite numerico. Lascia in bianco se vuoi che vengano visualizzate tutte le voci."],"Page Size":["Dimensione pagina"],"The number of entries to show per page. Leave blank to not use pagination.":["Il numero di voci da visualizzare per pagina. Lascia vuoto per non utilizzare la paginazione."],"No Entries Message":["Messaggio nessuna voce"],"View Key":["Visualizza la chiave"],"Detail Page Slug":["Slug della pagina dettagli"],"Example: If parameter name is 'contact', the url would be like %1$s\/selected-page?contact=2. If this entry is linked to a post, the post permalink will be used instead.":["Esempio: Se il nome del parametro è 'contatto', l'url sarebbe come %1$s\/pagina-selezionata?contatto=2. Se questa voce è legata ad un articolo, sarà invece utilizzato il permalink dell'articolo."],"Detail Page":["Pagina dettagli"],"Listing Page":["Pagina elenco"],"Use Entries from Form":["Utilizza voci dal modulo"],"Random":["Casuale"],"Date options: 'NOW' or a date in yyyy-mm-dd format.":["Opzioni Data: 'ORA' o una data nel formato gg-mm-yyyy."],"The new %1$s is coming soon.":["Il nuovo %1$s è in arrivo."],"Calendar Editor":["Editor del calendario"],"COMING SOON":["PROSSIMAMENTE"],"to receive news about the latest updates.":["per ricevere notizie sugli ultimi aggiornamenti."],"Subscribe to Formidable Forms":["Iscriviti a Formidable Forms"],"All content associated with this section will be deleted. Copy it and paste it into another section or it will be lost.":["Tutti i contenuti associati a questa sezione verranno eliminati. Copiali e incollali in un'altra sezione o andranno persi."],"Cancel":["Annulla"],"Switch to Classic":["Passa a Classic"],"Switch to Modern":[""],"Switch to Legacy":[""],"View Name":["Visualizza il nome"],"Detail Page Key":["Chiave della pagina di dettaglio"],"Reload full page":["Ricarica la pagina intera"],"AJAX pagination":["Paginazione AJAX"],"Load more entries":["Carica altre voci"],"Infinite scroll":["Scorrimento infinito"],"Pagination Type":["Tipo di paginazione"],"Calendar Settings":["Impostazioni del calendario"],"Event Time":[""],"Show Event Details Pop-up":[""],"When you hover over an event, a popup will appear with basic details about that event.":[""],"Pop-up Title":[""],"Pop-up Description":[""],"Pop-up Thumbnail":[""],"Select a form field that contains values like 1 week, 2 weeks, 1 year, etc. This will set the repeat period for each event.":["Seleziona un campo modulo che contenga valori come 1 settimana, 2 settimane, 1 anno, ecc. In questo modo verrà impostato il periodo di ripetizione per ogni evento."],"Select":["Seleziona"],"Grid Style Settings":["Impostazioni dello stile della griglia"],"Number of grid columns":["Numero di colonne della griglia"],"Row gap":["Distanza tra le righe"],"Column gap":["Distanza tra le colonne"],"Table Settings":["Impostazioni della tabella"],"Row Style":["Stile della riga"],"Match theme settings":["Abbina le impostazioni del tema"],"Zebra stripes":["Strisce zebrate"],"Make table responsive":["Rendi la tabella responsive"],"If this is on, the each column will display as a full row when the browser window is smaller than 760px width.":["Se questa è attiva, ogni colonna verrà visualizzata come una riga intera quando la finestra del browser ha una larghezza inferiore a 760px."],"Make grid responsive":["Rendi la griglia responsive"],"If this is on, the number of grid columns will go to one when the browser window is smaller than 750px width.":["Se questa è attiva, il numero di colonne della griglia passerà a uno quando la finestra del browser ha una larghezza inferiore a 750px."],"Metaboxes":["Metabox"],"Cell Settings":["Impostazioni della cella"],"Done":["Fatto"],"Switch to Classic View":["Passa alla visualizzazione classica"],"Switch to Modern View":[""],"Switch to Legacy View":[""],"This is irreversible. You will not be able to change back to a %1$s after updating.":["L'aggiornamento è irreversibile. Non sarà possibile tornare a %1$s dopo l'aggiornamento."],"Switching to classic gives you full control of the HTML, but it means that you will no longer have access to the layout builder or style editor tools.":["Passare a classico ti permette di avere il pieno controllo dell'HTML, ma significa che non avrai più accesso agli strumenti di builder del layout e editor di stile."],"Are you sure you want to switch?":["Confermi di voler cambiare?"],"Switching to modern adds a pop up and uses new styling compared to legacy calendars.":[""],"Switching to legacy removes the pop up and uses styles from previous versions of Views.":[""],"Switch":["Scambia"],"Small":["Piccolo"],"Regular":["Normale"],"Large":["Grande"],"Larger":["Più grande"],"Custom":["Personalizzato"],"Typography":["Tipografia"],"Background":["Sfondo"],"Border":["Bordo"],"Dotted":["Puntini"],"Dashed":["Tratteggiato"],"Solid":["Solido"],"Double":["Doppio"],"Groove":["Scanalatura"],"Ridge":["Ridge"],"Inset":["Inserto"],"Outset":["Outset"],"None":["Nessuna"],"Hidden":["Nascosto"],"Toggle Border Radius Options":[""],"Border radius":["Raggio del bordo"],"Padding":["Spaziatura interna"],"Custom Classes":["Classi personalizzate"],"Offset":["Offset"],"Adjust the offset to start displaying results from a specific point in your data set. For example, with a 1 offset and a page size of 10, the query will start from the second record, displaying the next 10 results.":["Regola l'offset per iniziare a visualizzare i risultati da un punto specifico del tuo set di dati. Ad esempio, con un offset di 1 e una dimensione della pagina di 10, la query partirà dal secondo record e visualizzerà i 10 risultati successivi."],"Copy this View to other sites when Formidable Forms is activated":["Copia questa vista in altri siti quando Formidable Forms è attivato"],"Refresh with AJAX when a form is submitted":[""],"Show code for this view":["Mostra il codice per questa vista"],"When enabled, this feature triggers an AJAX refresh of the view upon submission of a Formidable form, seamlessly updating the content without requiring a page reload.":[""],"This box is forcibly checked if you include a <table> tag in the Before Content box. If you are editing a view and notice the visual tab is selected and the table HTML is missing, you can switch to the HTML tab, close the content pop up, and reopen it. As long as the settings have not been saved, the old HTML will be back to way it was before loading it in the visual tab. While this is checked, the preview will also display the HTML as code.":["Questa casella viene forzatamente selezionata se includi un tag <table> nella casella Prima del contenuto. Se stai modificando una vista e noti che è selezionata la scheda Visuale e manca l'HTML della tabella, puoi passare alla scheda HTML, chiudere il pop-up del contenuto e riaprirlo. Se le impostazioni non sono state salvate, il vecchio HTML tornerà come era prima di essere caricato nella scheda Visuale. Se questa opzione è selezionata, l'anteprima mostrerà anche l'HTML come codice."],"Filter Content":["Filtrare il contenuto"],"Run Formidable shortcodes only":["Esegui solo gli shortcode di Formidable"],"Add paragraphs and process shortcodes":["Aggiungi paragrafi e processa gli shortcode"],"Run all content through WordPress (not recommended)":["Esegui tutti i contenuti attraverso WordPress (non è consigliato)"],"Select datasource":["Seleziona la fonte di dati"],"Grid View":["Vista griglia"],"Table View":["Vista della tabella"],"Single entry":["Voce singola"],"Insert view into application":["Inserisci la vista nell'applicazione"],"Click this button to add view content":["Fai clic su questo pulsante per aggiungere il contenuto della vista"],"Add After Content":["Aggiungi dopo il contenuto"],"Add Before Content":["Aggiungi prima del contenuto"],"Filter entries":["Filtra le voci"],"Sort entries":["Ordina le voci"],"Manage columns":["Gestisci le colonne"],"Layout builder":["Builder di layout"],"Add new group":["Aggiungi un nuovo gruppo"],"Enter value":["Inserisci il valore"],"And":["E"],"Or":["Oppure"],"Select Field":["Seleziona Campo"],"Add filter":["Aggiungi un filtro"],"Add row":["Aggiungi riga"],"Manage table columns":["Gestisci le colonne della tabella"],"Unselected fields":["Campi non selezionati"],"Column Name":["Nome della colonna"],"Add link to details page":["Aggiungi un link alla pagina dei dettagli"],"Delete":["Elimina"],"This form has no entries":["Questo modulo non ha voci"],"You can still add fields to this view. After receiving form submissions entries will be displayed here":["Puoi comunque aggiungere campi a questa vista. Dopo aver ricevuto l'invio del modulo, le voci verranno visualizzate qui"],"Or select another form with entries in the Advanced Settings":["Oppure seleziona un altro modulo con voci nelle Impostazioni avanzate"],"Start adding content":["Inizia ad aggiungere il contenuto"],"This table has no columns set":["Questa tabella non ha colonne impostate"],"Click \"Manage columns\" to start adding columns.":["Clicca su \"Gestisci colonne\" per iniziare ad aggiungere colonne."],"Build a repeatable layout":["Crea un layout ripetibile"],"Create a layout to present form data by clicking or dragging the rows above":["Crea un layout per presentare i dati del modulo facendo clic o trascinando le righe in alto"],"start adding content":["inizia ad aggiungere contenuti"],"into a single column view":["in una vista a colonna singola"],"Continue Anyway":["Continua in ogni caso"],"Build a custom layout for the page":["Crea un layout personalizzato per la pagina"],"Drag and drop rows into working area":["Trascina e rilascia le righe nell'area di lavoro"],"You can drop rows in a column and build complex layouts":["Puoi inserire righe in una colonna e creare layout complessi."],"The single entry detail view is not active":["La vista dei dettagli della singola voce non è attiva"],"This content is used to show more information about a single entry.":["Questo contenuto viene utilizzato per mostrare ulteriori informazioni su una singola voce."],"To use this page, include the [detaillink] shortcode in the content for All Entries.":["Per utilizzare questa pagina, includi lo shortcode [detaillink] nel contenuto di Tutte le voci."],"Layout Builder":["Builder del layout"],"Add Detail Link":["Aggiungi un link di dettaglio"],"Build a layout":["Costruisci un layout"],"Build layout":["Costruisci il layout"],"Drag and drop layout options to build a layout. You can also click an option to insert it.":["Trascina e rilascia le opzioni di layout per creare un layout. Puoi anche fare clic su un'opzione per inserirla."],"Close":["Chiuso"],"Are you ready to add data?":["Siamo pronti ad aggiungere dati?"],"If you are happy with the layout, save it and start adding content to the view.":["Se questo layout ti soddisfa, salvalo e inizia ad aggiungere contenuti alla vista."],"Add content":["Aggiungi il contenuto"],"Add data from the form to separate layout cells.":["Aggiungi i dati del modulo alle celle separate del layout."],"You've reached the maximum level of nesting. Try to delete this box or use another one.":["Hai raggiunto il livello massimo di annidamento. Prova a eliminare questa casella o a utilizzarne un'altra."],"Got it!":["Capito!"],"Click this button to add a row with one column":["Clicca su questo pulsante per aggiungere una riga con una sola colonna","Fai clic su questo pulsante per aggiungere una riga con %1$d colonne"],"and":["e"],"Click this button to add a row with %1$d columns, divided into %2$s":["Fai clic su questo pulsante per aggiungere una riga con %1$d colonne, divisa in %2$s"],"Edit Before Content":["Modifica prima del contenuto"],"Edit After Content":["Modifica dopo il contenuto"],"Edit Listing Page Content":["Modifica del contenuto della pagina dell'elenco"],"Edit Detail Page Content":["Modifica il contenuto della pagina di dettaglio"],"Navigate across the layout":["Naviga nel layout"],"Start editing the content of multiple cells at once.":["Inizia a modificare il contenuto di più celle contemporaneamente."],"Additional view settings":["Impostazioni di visualizzazione aggiuntive"],"Filter form entries, sort data, and toggle the layout builder at any time.":["Filtra le voci del modulo, ordina i dati e attiva\/disattiva il builder di layout in qualsiasi momento."],"Filter and sort form entries at any time.":["Filtra e ordina le voci del modulo in qualsiasi momento."],"Save Layout":["Salva il layout"],"View successfully saved!":["Vista salvata con successo!"],"Search views":["Ricerca viste"]}}}