{"translation-revision-date":"2024-07-30 00:31","generator":"WP-CLI\/2.10.0","source":"js\/editor.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"es_ES","plural-forms":"nplurals=2; plural=(n != 1);"},"Update":["Actualizar"],"Duplicate":["Duplicar"],"Actions":["Acciones"],"Advanced Settings":["Ajustes avanzados"],"Limit":["Límite"],"Default":["Por defecto"],"Ascending":["Ascendente"],"Descending":["Descendente"],"equals":["es igual a"],"does not equal":["no es igual a"],"is greater than":["es mayor que"],"is less than":["es menor que"],"is greater than or equal to":["es mayor o igual que"],"is less than or equal to":["es menor o igual que"],"contains":["contiene"],"does not contain":["no contiene"],"starts with":["empieza con"],"ends with":["termina con"],"is unique (get oldest entries)":["es único (obtiene las entradas más antiguas)"],"is unique (get newest entries)":["es único (obtiene las entradas más recientes)"],"Calendar":["Calendario"],"Grid":["Cuadrícula"],"Map":["Mapa"],"Classic":["Clásico"],"Entry creation date":["Fecha de creación del registro"],"Event Date":["Fecha del Evento"],"Entry update date":["Fecha de actualización del registro"],"End Date or Day Count":["Fecha Final o Conteo de Días"],"Repeat":["Repetir"],"No repeating events":["Eventos que no se repiten"],"End Repeat":["Finalizar Repetición"],"Never":["Nunca"],"If you don’t want all form entries displayed, you can insert the number limit here. Leave blank if you’d like all entries shown.":["Si no quieres que se muestren todas las entradas del formulario, puedes introducir aquí el número límite. Déjalo en blanco si quieres que se muestren todas las entradas."],"Page Size":["Tamaño de Página"],"The number of entries to show per page. Leave blank to not use pagination.":["El número de entradas a mostrar por página. Dejar en blanco para no utilizar la paginación."],"No Entries Message":["Mensaje cuando no hay registros"],"View Key":["Ver clave"],"Detail Page Slug":["Slug de la página de detalle"],"Example: If parameter name is 'contact', the url would be like %1$s\/selected-page?contact=2. If this entry is linked to a post, the post permalink will be used instead.":["Ejemplo: Si el nombre del parámetro es 'contacto', la URL sería como %1$s\/selected-page?contact=2. Si esta entrada está enlazada a una publicación, el permalink de la publicación se usará en su lugar."],"Detail Page":["Página de Detalle"],"Listing Page":["Página del listado"],"Use Entries from Form":["Usar los registros del formulario"],"Random":["Aleatorio"],"Date options: 'NOW' or a date in yyyy-mm-dd format.":["Opciones de fecha: \"AHORA\" o una fecha en formato aaaa-mm-dd."],"The new %1$s is coming soon.":["El nuevo %1$s llegará pronto."],"Calendar Editor":["Editor de calendarios"],"COMING SOON":["PRÓXIMAMENTE"],"to receive news about the latest updates.":["para recibir noticias sobre las últimas actualizaciones."],"Subscribe to Formidable Forms":["Suscríbete a Formidable Forms "],"All content associated with this section will be deleted. Copy it and paste it into another section or it will be lost.":["Todo el contenido asociado a esta sección será eliminado. Cópialo y pégalo en otra sección o se perderá."],"Cancel":["Cancelar"],"Switch to Classic":["Cambiar a clásico"],"Switch to Modern":[""],"Switch to Legacy":[""],"View Name":["Ver nombre"],"Detail Page Key":["Clave de la página de detalle"],"Reload full page":["Recargar página completa"],"AJAX pagination":["Paginación AJAX"],"Load more entries":["Cargar más registros"],"Infinite scroll":["Desplazamiento infinito"],"Pagination Type":["Tipo de paginación"],"Calendar Settings":["Ajustes del calendario"],"Event Time":[""],"Show Event Details Pop-up":[""],"When you hover over an event, a popup will appear with basic details about that event.":[""],"Pop-up Title":[""],"Pop-up Description":[""],"Pop-up Thumbnail":[""],"Select a form field that contains values like 1 week, 2 weeks, 1 year, etc. This will set the repeat period for each event.":["Selecciona un campo de formulario que contenga valores como 1 semana, 2 semanas, 1 año, etc. Esto establecerá el periodo de repetición para cada evento."],"Select":["Seleccionar"],"Grid Style Settings":["Ajustes del estilo de cuadrícula"],"Number of grid columns":["Número de columnas de la cuadrícula"],"Row gap":["Espacio entre filas"],"Column gap":["Espacio entre columnas"],"Table Settings":["Ajustes de tabla"],"Row Style":["Estilo de fila"],"Match theme settings":["Igualar los ajustes del tema"],"Zebra stripes":["Rayas de cebra"],"Make table responsive":["Hacer que la tabla sea adaptable"],"If this is on, the each column will display as a full row when the browser window is smaller than 760px width.":["Si está activado, cada columna se mostrará como una fila completa cuando la ventana del navegador tenga una anchura inferior a 760px."],"Make grid responsive":["Hacer que la cuadrícula sea adaptable"],"If this is on, the number of grid columns will go to one when the browser window is smaller than 750px width.":["Si está activado, el número de columnas de la cuadrícula pasará a uno cuando la ventana del navegador tenga una anchura inferior a 750px."],"Metaboxes":["Cajas meta"],"Cell Settings":["Ajustes de celda"],"Done":["Hecho"],"Switch to Classic View":["Cambiar a vista clásica"],"Switch to Modern View":[""],"Switch to Legacy View":[""],"This is irreversible. You will not be able to change back to a %1$s after updating.":["Esto es irreversible. No podrás volver a cambiar a %1$s después deactualizar."],"Switching to classic gives you full control of the HTML, but it means that you will no longer have access to the layout builder or style editor tools.":["Cambiar a clásico te da un control total del HTML, pero significa que ya no tendrás acceso al constructor de diseños ni a las herramientas del editor de estilos."],"Are you sure you want to switch?":["¿Estás seguro de que quieres cambiar?"],"Switching to modern adds a pop up and uses new styling compared to legacy calendars.":[""],"Switching to legacy removes the pop up and uses styles from previous versions of Views.":[""],"Switch":["Cambiar"],"Small":["Pequeño"],"Regular":["Normal"],"Large":["Grande"],"Larger":["Más grande"],"Custom":["Personalizado"],"Typography":["Tipografía"],"Background":["Fondo"],"Border":["Borde"],"Dotted":["Punteado"],"Dashed":["Discontínuo"],"Solid":["Sólido"],"Double":["Doble"],"Groove":["Acanalado"],"Ridge":["Canalón"],"Inset":["Embutido"],"Outset":["Relieve"],"None":["Ninguno"],"Hidden":["Oculto"],"Toggle Border Radius Options":[""],"Border radius":["Radio del borde"],"Padding":["Relleno"],"Custom Classes":["Clases personalizadas"],"Offset":["Compensación"],"Adjust the offset to start displaying results from a specific point in your data set. For example, with a 1 offset and a page size of 10, the query will start from the second record, displaying the next 10 results.":["Ajusta el desplazamiento para empezar a mostrar los resultados a partir de un punto concreto de tu conjunto de datos. Por ejemplo, con un desplazamiento de 1 y un tamaño de página de 10, la consulta empezará a partir del segundo registro, mostrando los 10 resultados siguientes."],"Copy this View to other sites when Formidable Forms is activated":["Copia esta vista a otros sitios cuando Formidable Forms esté activado"],"Refresh with AJAX when a form is submitted":[""],"Show code for this view":["Mostrar el código de esta vista"],"When enabled, this feature triggers an AJAX refresh of the view upon submission of a Formidable form, seamlessly updating the content without requiring a page reload.":[""],"This box is forcibly checked if you include a <table> tag in the Before Content box. If you are editing a view and notice the visual tab is selected and the table HTML is missing, you can switch to the HTML tab, close the content pop up, and reopen it. As long as the settings have not been saved, the old HTML will be back to way it was before loading it in the visual tab. While this is checked, the preview will also display the HTML as code.":["Esta casilla se marca forzosamente si incluyes una etiqueta <table> en la casilla Antes del contenido. Si estás editando una vista y observas que está seleccionada la pestaña visual y falta el HTML de la tabla, puedes cambiar a la pestaña HTML, cerrar la ventana emergente de contenido y volver a abrirla. Mientras no se hayan guardado los ajustes, el antiguo HTML volverá a ser el que era antes de cargarlo en la pestaña visual. Mientras esto esté marcado, la vista previa también mostrará el HTML como código."],"Filter Content":["Filtrar contenido"],"Run Formidable shortcodes only":["Ejecutar sólo los shortcodes de Formidable"],"Add paragraphs and process shortcodes":["Añadir párrafos y procesar shortcodes"],"Run all content through WordPress (not recommended)":["Ejecutar todo el contenido a través de WordPress (no recomendado)"],"Select datasource":["Seleccionar fuente de datos"],"Grid View":["Vista de cuadrícula"],"Table View":["Vista de tabla"],"Single entry":["Registro único"],"Insert view into application":["Insertar vista en la aplicación"],"Click this button to add view content":["Pulsa este botón para añadir el contenido de la vista"],"Add After Content":["Añadir después del contenido"],"Add Before Content":["Añadir antes del contenido"],"Filter entries":["Filtrar registros"],"Sort entries":["Ordenar registros"],"Manage columns":["Gestionar columnas"],"Layout builder":["Maquetador de diseños"],"Add new group":["Añadir un grupo nuevo"],"Enter value":["Introduce el valor"],"And":["Y"],"Or":["O"],"Select Field":["Seleccionar Campo"],"Add filter":["Añadir filtro"],"Add row":["Añadir fila"],"Manage table columns":["Gestionar las columnas de la tabla"],"Unselected fields":["Campos no seleccionados"],"Column Name":["Nombre de la columna"],"Add link to details page":["Añadir enlace a la página de detalle"],"Delete":["Borrar"],"This form has no entries":["Este formulario no tiene registros"],"You can still add fields to this view. After receiving form submissions entries will be displayed here":["Todavía puedes añadir campos a esta vista. Después de recibir los envíos de formularios, las entradas se mostrarán aquí"],"Or select another form with entries in the Advanced Settings":["O selecciona otro formulario con entradas en los ajustes avanzados"],"Start adding content":["Empieza a añadir contenido"],"This table has no columns set":["Esta tabla no tiene columnas definidas"],"Click \"Manage columns\" to start adding columns.":["Haz clic en «Gestionar columnas» para empezar a añadir columnas."],"Build a repeatable layout":["Construye una estructura repetible"],"Create a layout to present form data by clicking or dragging the rows above":["Crea un diseño para presentar los datos del formulario haciendo clic o arrastrando las filas de arriba"],"start adding content":["empieza a añadir contenido"],"into a single column view":["en una vista de una sola columna"],"Continue Anyway":["Seguir de todos modos"],"Build a custom layout for the page":["Construye una estructura personalizada para la página"],"Drag and drop rows into working area":["Arrastra y suelta filas en el área de trabajo"],"You can drop rows in a column and build complex layouts":["Puedes colocar filas en una columna y construir estructuras complejas"],"The single entry detail view is not active":["La vista de detalle de entrada individual no está activa"],"This content is used to show more information about a single entry.":["Este contenido se utiliza para mostrar más información sobre una entrada individual."],"To use this page, include the [detaillink] shortcode in the content for All Entries.":["Para utilizar esta página, incluye el shortcode [detaillink] en el contenido de Todas los registros."],"Layout Builder":["Maquetador de estructuras"],"Add Detail Link":["Añadir enlace de detalle"],"Build a layout":["Construye una estructura"],"Build layout":["Construye la estructura"],"Drag and drop layout options to build a layout. You can also click an option to insert it.":["Arrastra y suelta las opciones de estructura para construir una estructura. También puedes hacer clic en una opción para insertarlo."],"Close":["Cerrado"],"Are you ready to add data?":["¿Estás preparado para añadir datos?"],"If you are happy with the layout, save it and start adding content to the view.":["Si estás satisfecho con el diseño, guárdalo y empieza a añadir contenido a la vista."],"Add content":["Añadir contenido"],"Add data from the form to separate layout cells.":["Añade datos del formulario a celdas de diseño separadas."],"You've reached the maximum level of nesting. Try to delete this box or use another one.":["Has alcanzado el nivel máximo de anidamiento. Intenta eliminar esta caja o utiliza otra."],"Got it!":["¡Entendido!"],"Click this button to add a row with one column":["Pulsa este botón para añadir una fila con una columna","Pulsa este botón para añadir una fila con %1$d columnas"],"and":["y"],"Click this button to add a row with %1$d columns, divided into %2$s":["Pulsa este botón para añadir una fila con %1$d columnas, divididas en %2$s"],"Edit Before Content":["Editar antes del contenido"],"Edit After Content":["Editar después del contenido"],"Edit Listing Page Content":["Editar el contenido de la página del listado"],"Edit Detail Page Content":["Editar el contenido de la página de detalle"],"Navigate across the layout":["Navega por la estructura"],"Start editing the content of multiple cells at once.":["Empieza a editar el contenido de varias celdas a la vez."],"Additional view settings":["Ajustes adicionales de la vista"],"Filter form entries, sort data, and toggle the layout builder at any time.":["Filtra los registros del formulario, ordena los datos y activa el constructor de diseño en cualquier momento."],"Filter and sort form entries at any time.":["Filtra y ordena los registros del formulario en cualquier momento."],"Save Layout":["Guardar diseño"],"View successfully saved!":["¡Vista guardada correctamente!"],"Search views":["Buscar vistas"]}}}