{"translation-revision-date":"2024-07-30 00:31","generator":"WP-CLI\/2.10.0","source":"js\/welcome.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"de_DE","plural-forms":"nplurals=2; plural=(n != 1);"},"Welcome to Visual Views":["Willkommen bei Visual Views"],"Use Views to build any custom web application you can imagine. It starts when users submit a form. The user-generated content can be used in job boards, staff directories, testimonials, recipes, and so much more.":["Mit Views kannst du jede erdenkliche Webanwendung erstellen. Es fängt damit an, dass Nutzer ein Formular ausfüllen. Die nutzergenerierten Inhalte können in Jobbörsen, Mitarbeiterverzeichnissen, Erfahrungsberichten, Rezepten und vielem mehr verwendet werden."],"Build a custom layout to display entries":["Erstelle ein benutzerdefiniertes Layout, um Einträge anzuzeigen"],"Create a unique card layout to present form data. This card will repeat for each form entry.":["Erstelle ein einmaliges Layout, um die Formulardaten zu präsentieren. Dieses Layout wird sich für jeden Formulareintrag wiederholen."],"Add data to the View":["Daten zur Ansicht hinzufügen"],"Click the plus icon then add or edit content in each box. The editor modal gives you access to the form data to insert.":["Klicke auf das Plus-Symbol und füge dann in jedem Feld Inhalte hinzu oder bearbeite sie. Das Editor-Modal gibt dir Zugriff auf die Formulardaten, die du einfügen kannst."],"Filter and sort form entries":["Formulareinträge filtern und sortieren"],"Add groups of conditions to get the exact entries you need.":["Füge Gruppen von Bedingungen hinzu, um genau die Einträge zu erhalten, die du brauchst."],"Add content before the repeating sections":["Inhalt vor den sich wiederholenden Abschnitten hinzufügen"],"Add search boxes, table headers, and other content before the list of entries.":["Füge Suchfelder, Tabellenüberschriften und andere Inhalte vor der Liste der Einträge ein."],"Continue":["Weiter"],"Skip":["Überspringen"]}}}