{"translation-revision-date":"2024-07-30 00:31","generator":"WP-CLI\/2.10.0","source":"js\/welcome.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"it_IT","plural-forms":"nplurals=2; plural=(n != 1);"},"Welcome to Visual Views":["Benvenuti in Visual Views"],"Use Views to build any custom web application you can imagine. It starts when users submit a form. The user-generated content can be used in job boards, staff directories, testimonials, recipes, and so much more.":["Usa le Viste per costruire qualsiasi applicazione web personalizzata che tu possa immaginare. Tutto inizia quando gli utenti compilano un modulo. I contenuti generati dagli utenti possono essere utilizzati in bacheche di lavoro, elenchi di personale, testimonianze, ricette e molto altro ancora."],"Build a custom layout to display entries":["Crea un layout personalizzato per visualizzare le voci"],"Create a unique card layout to present form data. This card will repeat for each form entry.":["Crea un layout della carta unico per presentare i dati del modulo. Questa carta si ripeterà per ogni voce del modulo."],"Add data to the View":["Aggiungere dati alla vista"],"Click the plus icon then add or edit content in each box. The editor modal gives you access to the form data to insert.":["Fai clic sull'icona più e poi aggiungi o modifica il contenuto in ogni casella. L'editor modal ti permette di accedere ai dati del modulo da inserire."],"Filter and sort form entries":["Filtra e ordina le voci del modulo"],"Add groups of conditions to get the exact entries you need.":["Aggiungi gruppi di condizioni per ottenere le voci esatte di cui hai bisogno."],"Add content before the repeating sections":["Aggiungi il contenuto prima delle sezioni ripetute"],"Add search boxes, table headers, and other content before the list of entries.":["Aggiungi caselle di ricerca, intestazioni di tabelle e altri contenuti prima dell'elenco delle voci."],"Continue":["Continua"],"Skip":["Salta"]}}}