{"translation-revision-date":"2024-07-30 00:31","generator":"WP-CLI\/2.10.0","source":"js\/welcome.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"es_ES","plural-forms":"nplurals=2; plural=(n != 1);"},"Welcome to Visual Views":["Bienvenido a Visual Views"],"Use Views to build any custom web application you can imagine. It starts when users submit a form. The user-generated content can be used in job boards, staff directories, testimonials, recipes, and so much more.":["Utiliza Views para construir cualquier aplicación web personalizada que puedas imaginar. Empieza cuando los usuarios envíen un formulario. El contenido generado por el usuario puede utilizarse en bolsas de trabajo, directorios de personal, testimonios, recetas y mucho más."],"Build a custom layout to display entries":["Construye un diseño personalizado para mostrar los registros"],"Create a unique card layout to present form data. This card will repeat for each form entry.":["Crea un diseño de tarjeta único para presentar los datos del formulario. Esta tarjeta se repetirá para cada registro del formulario."],"Add data to the View":["Añadir datos a la vista"],"Click the plus icon then add or edit content in each box. The editor modal gives you access to the form data to insert.":["Haz clic en el icono más y luego añade o edita contenido en cada casilla. La modal del editor te da acceso a los datos del formulario a insertar."],"Filter and sort form entries":["Filtrar y ordenar registros de formulario"],"Add groups of conditions to get the exact entries you need.":["Añade grupos de condiciones para obtener los registros exactos que necesitas."],"Add content before the repeating sections":["Añade contenido antes de las secciones repetitivas"],"Add search boxes, table headers, and other content before the list of entries.":["Añade cuadros de búsqueda, encabezados de tabla y otros contenidos antes de la lista de registros."],"Continue":["Continuar"],"Skip":["Omitir"]}}}